In [1]:
import pandas as pd
df = pd.read_csv(r"C:\\Users\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2012\\mls-salaries-2012.csv")
df

    club  last_name first_name position  base_salary  guaranteed_compensation
0    PHI        Adu     Freddy        M     400000.0                519000.00
1    CHV    Agudelo       Juan        F      70000.0                100000.00
2     KC  Aiyegbusi  Olukorede        D      44100.0                 44100.00
3    COL      Akpan      Andre        F      57200.0                 57200.00
4    PHI   Albright      Chris        D      55000.0                 55000.00
..   ...        ...        ...      ...          ...                      ...
549  COL     Zapata       Luis        D      65460.0                 69043.33
550   SJ     Zayner        Jed        D      60000.0                 61666.67
551  CHV   Zemanski        Ben        M      57690.0                 60190.00
552  POR      Zizzo        Sal        F      73125.0                 81414.06
553   KC       Zusi     Graham      F-M     105000.0                138812.50

[554 rows x 6 columns]

In [2]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

              full_name  base_salary
512    Thierry Henry NY   5000000.00
441   Rafael Marquez NY   4600000.00
514       Tim Cahill NY   3499999.92
151    David Beckham LA   3000000.00
453     Robbie Keane LA   2917241.00
..                  ...          ...
466       Ryan Meara NY     33750.00
465    Ryan Kawulok POR     33750.00
322  Konrad Warzycha KC     33750.00
328      Kyle Miller KC     33750.00
313  Kenny Mansally RSL     33750.00

[550 rows x 2 columns]

In [3]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
F      222135.738413
M-F    189247.727273
M      156708.808032
D      138713.418723
M-D    130625.000000
F-M    117500.000000
M/F    108499.000000
D/F    100000.000000
D-M     83753.800000
GK      77205.579375
D/M     70000.000000
M/D     44100.000000
MF      44100.000000
Name: base_salary, dtype: float64

In [4]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
NY      564798.909286
LA      349220.032258
TOR     202054.185185
TFC     187002.000000
VAN     162559.498571
DAL     162184.968000
MTL     123351.892857
DC      123345.685714
RSL     123337.886154
SEA     118430.656250
POR     118003.626250
CHI     116135.935484
COL     111111.570000
CHV     108847.428571
HOU     107450.594074
CLB     103704.466667
PHI     102178.788571
KC       99781.275862
SJ       95938.876333
NE       87880.998462
POOL     37202.000000
Name: base_salary, dtype: float64

In [5]:
df['base_salary'].mean()

156124.18424187726

In [6]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

112109.08635531136